; domain
(define (domain transport)
    (:predicates (aeroport ?r)  (at ?c ?r)  (avio ?a)  (carrega ?c)  (dins ?c ?a))
    (:action carregar
        :parameters (?a ?c ?r)
        :precondition (and (at ?c ?r) (at ?a ?r) (carrega ?c) (avio ?a) (aeroport ?r))
        :effect (and (not (at ?c ?r)) (dins ?c ?a))
    )
     (:action descarregar
        :parameters (?a ?c ?r)
        :precondition (and (dins ?c ?a) (at ?a ?r) (carrega ?c) (avio ?a) (aeroport ?r))
        :effect (and (at ?c ?r) (not (dins ?c ?a)))
    )
     (:action volar
        :parameters (?a ?origen ?desti)
        :precondition (and (at ?a ?origen) (avio ?a) (aeroport ?origen) (aeroport ?desti))
        :effect (and (not (at ?a ?origen)) (at ?a ?desti))
    )
)

; problem
(define (problem transport-mad-bcn)
    (:domain transport)
    (:objects a1 a2 bcn c1 c2 mad)
    (:init (aeroport bcn) (aeroport mad) (at a1 mad) (at a2 bcn) (at c1 mad) (at c2 bcn) (avio a1) (avio a2) (carrega c1) (carrega c2))
    (:goal (and (at c1 bcn) (at c2 mad)))
)

; plan
1. (carregar a2 c2 bcn)
   deleted: (at c2 bcn)
   added: (dins c2 a2)
   goals met: 0 of 2
2. (carregar a1 c1 mad)
   deleted: (at c1 mad)
   added: (dins c1 a1)
   goals met: 0 of 2
3. (volar a2 bcn mad)
   deleted: (at a2 bcn)
   added: (at a2 mad)
   goals met: 0 of 2
4. (descarregar a2 c2 mad)
   deleted: (dins c2 a2)
   added: (at c2 mad)
   goals met: 1 of 2
5. (volar a1 mad bcn)
   deleted: (at a1 mad)
   added: (at a1 bcn)
   goals met: 1 of 2
6. (descarregar a1 c1 bcn)
   deleted: (dins c1 a1)
   added: (at c1 bcn)
   goals met: 2 of 2
